app/controllers/public_arenas_controller.rb

SELECT  "public_arenas".* FROM "public_arenas" WHERE "public_arenas"."id" = ? LIMIT 1  [["id", 80]]
---
  def show
    @public_arena = PublicArena.find(params[:id])